Обработки/Reports/_РезультатыПокупкиПродажиЦенныхБумагПоДоговорамРЕПО_ПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РезультатыПокупкиПродажиЦенныхБумагПоДоговорамРЕПО_ПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РезультатыПокупкиПродажиЦенныхБумагПоДоговорамРЕПО_ПФР/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Результаты покупки (продажи) ценных бумаг по договорам РЕПО (ПФР)",
		"0.9",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", 					ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",					ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Курс
		|ПОМЕСТИТЬ _КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПО1.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки КАК ВидСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.Дата КАК ДатаПервойЧасти,
		|	УсловияСделокРЕПО1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокРЕПО1.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	УсловияСделокРЕПО2.СтавкаРЕПО КАК СтавкаРЕПО,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО1.ДатаОплаты > УсловияСделокРЕПО1.ДатаПоставки
		|			ТОГДА УсловияСделокРЕПО1.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПО1.ДатаОплаты
		|	КОНЕЦ КАК ДатаИсполнения,
		|	УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона КАК СуммаПервойЧасти,
		|	УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона КАК СуммаВторойЧасти
		|ПОМЕСТИТЬ _СделкиРЕПО_НачалоПериода
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 1
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&НачалоПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО2
		|		ПО УсловияСделокРЕПО1.Организация = УсловияСделокРЕПО2.Организация
		|			И УсловияСделокРЕПО1.СчетДоверительногоУправления = УсловияСделокРЕПО2.СчетДоверительногоУправления
		|			И УсловияСделокРЕПО1.СделкаРЕПО = УсловияСделокРЕПО2.СделкаРЕПО
		|			И УсловияСделокРЕПО1.Рынок = УсловияСделокРЕПО2.Рынок
		|			И УсловияСделокРЕПО1.ЦеннаяБумага = УсловияСделокРЕПО2.ЦеннаяБумага
		|ГДЕ
		|	(УсловияСделокРЕПО1.ДатаОплаты <= &НачалоПериода
		|			ИЛИ УсловияСделокРЕПО1.ДатаПоставки <= &НачалоПериода)
		|	И НЕ УсловияСделокРЕПО1.Отменено
		|	И (УсловияСделокРЕПО2.ДатаОплаты > &НачалоПериода
		|				И УсловияСделокРЕПО2.ДатаПоставки > &НачалоПериода
		|			ИЛИ УсловияСделокРЕПО2.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|				И УсловияСделокРЕПО2.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ УсловияСделокРЕПО2.Отменено
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПО1.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки КАК ВидСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.Дата КАК ДатаПервойЧасти,
		|	УсловияСделокРЕПО1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокРЕПО1.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	УсловияСделокРЕПО2.СтавкаРЕПО КАК СтавкаРЕПО,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО1.ДатаОплаты > УсловияСделокРЕПО1.ДатаПоставки
		|			ТОГДА УсловияСделокРЕПО1.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПО1.ДатаОплаты
		|	КОНЕЦ КАК ДатаИсполнения,
		|	УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона КАК СуммаПервойЧасти,
		|	УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона КАК СуммаВторойЧасти
		|ПОМЕСТИТЬ _СделкиРЕПО_ВнутриПериода
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 1
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО2
		|		ПО УсловияСделокРЕПО1.Организация = УсловияСделокРЕПО2.Организация
		|			И УсловияСделокРЕПО1.СчетДоверительногоУправления = УсловияСделокРЕПО2.СчетДоверительногоУправления
		|			И УсловияСделокРЕПО1.СделкаРЕПО = УсловияСделокРЕПО2.СделкаРЕПО
		|			И УсловияСделокРЕПО1.Рынок = УсловияСделокРЕПО2.Рынок
		|			И УсловияСделокРЕПО1.ЦеннаяБумага = УсловияСделокРЕПО2.ЦеннаяБумага
		|ГДЕ
		|	(УсловияСделокРЕПО1.ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ УсловияСделокРЕПО1.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода)
		|	И НЕ УсловияСделокРЕПО1.Отменено
		|	И УсловияСделокРЕПО2.ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода
		|	И УсловияСделокРЕПО2.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ УсловияСделокРЕПО2.Отменено
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПО1.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки КАК ВидСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	УсловияСделокРЕПО1.СделкаРЕПО.Дата КАК ДатаПервойЧасти,
		|	УсловияСделокРЕПО1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокРЕПО1.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	УсловияСделокРЕПО2.СтавкаРЕПО КАК СтавкаРЕПО,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО1.ДатаОплаты > УсловияСделокРЕПО1.ДатаПоставки
		|			ТОГДА УсловияСделокРЕПО1.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПО1.ДатаОплаты
		|	КОНЕЦ КАК ДатаИсполнения,
		|	УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона КАК СуммаПервойЧасти,
		|	УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона КАК СуммаВторойЧасти
		|ПОМЕСТИТЬ _СделкиРЕПО_КонецПериода
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 1
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДоверительногоУправления)) КАК УсловияСделокРЕПО2
		|		ПО УсловияСделокРЕПО1.Организация = УсловияСделокРЕПО2.Организация
		|			И УсловияСделокРЕПО1.СчетДоверительногоУправления = УсловияСделокРЕПО2.СчетДоверительногоУправления
		|			И УсловияСделокРЕПО1.СделкаРЕПО = УсловияСделокРЕПО2.СделкаРЕПО
		|			И УсловияСделокРЕПО1.Рынок = УсловияСделокРЕПО2.Рынок
		|			И УсловияСделокРЕПО1.ЦеннаяБумага = УсловияСделокРЕПО2.ЦеннаяБумага
		|ГДЕ
		|	(УсловияСделокРЕПО1.ДатаОплаты <= &КонецПериода
		|			ИЛИ УсловияСделокРЕПО1.ДатаПоставки <= &КонецПериода)
		|	И НЕ УсловияСделокРЕПО1.Отменено
		|	И (УсловияСделокРЕПО2.ДатаОплаты > &КонецПериода
		|				И УсловияСделокРЕПО2.ДатаПоставки > &КонецПериода
		|			ИЛИ УсловияСделокРЕПО2.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|				И УсловияСделокРЕПО2.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ УсловияСделокРЕПО2.Отменено
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиРЕПО_НачалоПериода.СуммаПервойЧасти * _КурсыВалют.Курс КАК РазмещеноНаНачалоГода,
		|	0 КАК РазмещеноЗаОтчетныйГод,
		|	_СделкиРЕПО_НачалоПериода.СуммаВторойЧасти * _КурсыВалютВторойЧасти.Курс КАК ВозвращеноЗаОтчетныйГодВсего,
		|	_СделкиРЕПО_НачалоПериода.СуммаВторойЧасти * _КурсыВалютВторойЧасти.Курс - _СделкиРЕПО_НачалоПериода.СуммаПервойЧасти * _КурсыВалют.Курс КАК ВозвращеноЗаОтчетныйГодДоход,
		|	0 КАК ПодлежитВозвратуНаКонецГода
		|ПОМЕСТИТЬ _СуммыРЕПО
		|ИЗ
		|	_СделкиРЕПО_НачалоПериода КАК _СделкиРЕПО_НачалоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _СделкиРЕПО_НачалоПериода.ВалютаСделки = _КурсыВалют.Валюта
		|			И (_КурсыВалют.Период = &НачалоПериода)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютВторойЧасти
		|		ПО _СделкиРЕПО_НачалоПериода.ДатаВторойЧастиРЕПО = _КурсыВалютВторойЧасти.Период
		|			И _СделкиРЕПО_НачалоПериода.ВалютаСделки = _КурсыВалютВторойЧасти.Валюта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	_СделкиРЕПО_ВнутриПериода.СуммаПервойЧасти * _КурсыВалютПервойЧасти.Курс,
		|	_СделкиРЕПО_ВнутриПериода.СуммаВторойЧасти * _КурсыВалютВторойЧасти.Курс,
		|	_СделкиРЕПО_ВнутриПериода.СуммаВторойЧасти * _КурсыВалютВторойЧасти.Курс - _СделкиРЕПО_ВнутриПериода.СуммаПервойЧасти * _КурсыВалютПервойЧасти.Курс,
		|	0
		|ИЗ
		|	_СделкиРЕПО_ВнутриПериода КАК _СделкиРЕПО_ВнутриПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютПервойЧасти
		|		ПО _СделкиРЕПО_ВнутриПериода.ВалютаСделки = _КурсыВалютПервойЧасти.Валюта
		|			И (НАЧАЛОПЕРИОДА(_СделкиРЕПО_ВнутриПериода.ДатаПервойЧасти, ДЕНЬ) = _КурсыВалютПервойЧасти.Период)
		|			И _СделкиРЕПО_ВнутриПериода.ВалютаСделки = _КурсыВалютПервойЧасти.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютВторойЧасти
		|		ПО _СделкиРЕПО_ВнутриПериода.ДатаВторойЧастиРЕПО = _КурсыВалютВторойЧасти.Период
		|			И _СделкиРЕПО_ВнутриПериода.ВалютаСделки = _КурсыВалютВторойЧасти.Валюта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	_СделкиРЕПО_КонецПериода.СуммаПервойЧасти * _КурсыВалют.Курс
		|ИЗ
		|	_СделкиРЕПО_КонецПериода КАК _СделкиРЕПО_КонецПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
		|		ПО _СделкиРЕПО_КонецПериода.ВалютаСделки = _КурсыВалют.Валюта
		|			И (_КурсыВалют.Период = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	_СчетаДоверительногоУправления.НаименованиеУК КАК НаименованиеУК,
		|	ВложенныйЗапрос.РазмещеноНаНачалоГода КАК РазмещеноНаНачалоГода,
		|	ВложенныйЗапрос.РазмещеноЗаОтчетныйГод + ВложенныйЗапрос.ПодлежитВозвратуНаКонецГода КАК РазмещеноЗаОтчетныйГод,
		|	ВложенныйЗапрос.ВозвращеноЗаОтчетныйГодВсего КАК ВозвращеноЗаОтчетныйГодВсего,
		|	ВложенныйЗапрос.ВозвращеноЗаОтчетныйГодДоход КАК ВозвращеноЗаОтчетныйГодДоход,
		|	ВложенныйЗапрос.ПодлежитВозвратуНаКонецГода КАК ПодлежитВозвратуНаКонецГода
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления,
		|	(ВЫБРАТЬ
		|		СУММА(_СуммыРЕПО.РазмещеноНаНачалоГода) КАК РазмещеноНаНачалоГода,
		|		СУММА(_СуммыРЕПО.РазмещеноЗаОтчетныйГод) КАК РазмещеноЗаОтчетныйГод,
		|		СУММА(_СуммыРЕПО.ВозвращеноЗаОтчетныйГодВсего) КАК ВозвращеноЗаОтчетныйГодВсего,
		|		СУММА(_СуммыРЕПО.ВозвращеноЗаОтчетныйГодДоход) КАК ВозвращеноЗаОтчетныйГодДоход,
		|		СУММА(_СуммыРЕПО.ПодлежитВозвратуНаКонецГода) КАК ПодлежитВозвратуНаКонецГода
		|	ИЗ
		|		_СуммыРЕПО КАК _СуммыРЕПО) КАК ВложенныйЗапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для формирования отчета");
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");	
	
	ОбластьОтчет = Макет.ПолучитьОбласть("Отчет");
	
	ОбластьОтчет.Параметры.Заполнить(Выборка);
	ОбластьОтчет.Параметры.Год = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyy");
	ОбластьОтчет.Параметры.ДоговорДУ = "№ " + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy") + " г.";
	ОбластьОтчет.Параметры.Подписант = ЭтотОбъект.Подписант; //ПолучитьФИО(ЭтотОбъект.Подписант, ЭтотОбъект.Период.ДатаОкончания); 
	ОбластьОтчет.Параметры.ПодписантДолжность = ЭтотОбъект.ПодписантДолжность;
	                                          	
	ДокументРезультат.Вывести(ОбластьОтчет);                                  	
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры
